<template>
  <div class="RegProtocol">
      <h1 class="left">重要提示：</h1>

      <p>鸿特金服APP是由广东鸿特信息咨询有限公司（简称“鸿特信息”）合法运营的移动用户端（以下简称“鸿特金服平台”），鸿特金服平台依据本协议为平台用户（以下简称“用户”或“您”）提供服务。在您成为鸿特金服平台注册会员前，鸿特信息有义务在此特别提醒您务必认真阅读、充分理解本协议各条款，特别是其中所涉及的免除或限制鸿特信息责任的条款、排除或限制您权利的条款等。请您审慎阅读并选择接受或不接受本协议。除非您接受本协议所有条款，否则您无权使用鸿特信息于本协议下所提供的服务。一经注册或使用鸿特信息服务即视为您对本协议全部条款已充分理解并完全接受。
      </p>

      <h1>第一章 声明和承诺</h1>

      <p><span class="n">第一条</span>为了保障您的权益，请您确认您在自愿注册并使用鸿特金服平台服务前，已仔细阅读并充分理解知悉本服务协议所有条款。一经注册或使用鸿特金服平台服务即视为对本服务协议的充分理解和接受；如有违反而导致任何法律后果，您将自己独立承担相应的法律责任。</p>

      <p><span class="n">第二条</span>鸿特金服平台用户是指年满18周年并符合中华人民共和国法律规定的具有完全民事权利和民事行为能力，能够独立承担民事责任的自然人。请您确认您在注册和使用鸿特金服平台服务前，已具备前述条件；否则，您应立即终止注册或停止使用鸿特金服平台提供的服务，若您不具备上述条件仍进行注册由此引发相关行为不具有法律效力的后果，且由于您的行为造成鸿特信息或他人财产或人身权益或合同权益无法实现，均应由您负责并承担全部责任。</p>

      <p><span class="n">第三条</span>请您确认你的注册行为和通过鸿特金服平台进行的所有操作，均为您的真实意思表示。且你承诺将按照鸿特金服平台要求提示提供真实、最新、有效及完整的资料，否则，鸿特金服平台有权拒绝用户使用鸿特金服平台部分或全部功能或停用其账户。因此造成的直接或间接损失，鸿特信息不承担任何责任。</p>

      <p><span class="n">第四条</span>鸿特金服平台用户同意并保证不得利用鸿特金服平台服务从事侵害他人权益或违法之行为，若有违反者应负所有法律责任。</p>

      <p><span class="n">第五条</span>鸿特金服平台用户承诺，其通过鸿特金服平台上传或发布的信息均真实有效，其向鸿特信息提交的任何资料均真实、有效、完整、详细、准确。如因违背上述承诺，造成鸿特信息或鸿特金服平台其他用户损失的，用户将承担相应责任。</p>

      <p><span class="n">第六条</span>在本服务协议履行过程中，鸿特信息可根据经营需要对本协议内容进行单方面的合理变更，一旦本服务协议的内容发生变动，将在鸿特金服平台上公布最新的服务协议，不再向鸿特金服平台用户作个别通知。如果用户不同意对本协议所做的修改，用户有权停止使用鸿特金服平台服务。如果用户继续使用鸿特金服平台服务，则视为用户接受鸿特信息对本服务协议所做的修改，并应遵照修改后的协议执行。</p>

      <p><span class="n">第七条</span>鸿特金服平台对于鸿特金服平台用户的通知及任何其他的协议、告示或其他关于鸿特金服平台用户使用账户及服务的通知，您同意鸿特信息可通过鸿特金服平台公告、站内信、电子邮件、手机短信、无线通讯装置等电子方式或邮寄等物理方式进行，该等通知于发送之日视为已送达收件人。因不可归责于鸿特信息的原因导致用户未在前述通知视为送达之日收到该等通知的，鸿特信息不承担任何责任。</p>

      <p><span class="n">第八条</span>在鸿特金服平台交易需订立的合同均采用电子合同方式。用户使用账户登录鸿特金服平台后，根据鸿特金服平台的相关规则，以用户账户ID在鸿特金服平台通过点击确认或类似方式签署的电子合同即视为用户本人真实意愿并以用户本人名义签署的合同，具有法律效力。用户应妥善保管自己的账户密码等账户信息，用户通过前述方式订立的电子合同对合同当事人具有法律约束力，用户不得以账户密码等账户信息被盗用或其他理由否认已订立的合同的效力或不按照该等合同履行相关义务。用户根据本协议以及相关规则签署电子合同后，不得擅自修改该合同。如对此有任何争议，应以鸿特金服平台后台系统记录的合同为准。用户不得私自仿制、伪造在鸿特金服平台上签订的电子合同或印章，不得用伪造的合同进行招摇撞骗或进行其他非法使用，否则由用户自行承担责任。 </p>

      <p><span class="n">第九条</span>用户同意接受鸿特信息提供的借款融资信息咨询服务，即由鸿特信息受用户委托在其他融资鸿特金服平台发标融资以及与合法的出借人或其他相关方达成协议并完成借贷交易，并由鸿特信息受用户委托代为处理签署的合同及/或协议履行有关的其他服务。</p>

      <p><span class="n">第十条</span>鸿特信息可以依其判断暂时停止提供、限制或改变鸿特金服平台服务，只要用户仍然使用鸿特金服平台服务，即表示用户仍然同意本协议。</p>

      <h1>第二章 平台服务的内容</h1>

      <p><span class="n">第十一条</span>鸿特信息为用户提供专业及高效的金融信息咨询服务，主要包括用户身份信息认证、用户资质评估、根据用户需求提供融资方案以及提供线下客户服务等，具体详情以鸿特金服平台当时提供的服务内容为准。</p>

      <p><span class="n">第十二条</span>鸿特金服平台服务的部分内容需要用户根据鸿特信息需求通过手机等移动设备完成实名身份认证及相关移动终端信息授权，未进行身份认证和授权将无法使用部分服务，因未能完成认证和授权而无法享受鸿特金服平台服务造成的损失，鸿特信息不承担任何责任。</p>

      <p><span class="n">第十三条</span>鸿特信息为用户提供的资质评估服务需要用户根据鸿特信息要求提示自主提供或授权鸿特信息采集包括但不限于用户个人身份证信息、银行卡信息、学历信息、手机设备信息、通信通讯信息、联系地址、个人信用报告、个人社会保险信息、银行账目往来、动产或不动产等财产状况证明文件及信息，鸿特信息根据前述资料对客户的资信状况及偿债能力进行综合资质评估。</p>

      <p><span class="n">第十四条</span>鸿特信息为用户提供的融资方案服务是根据用户申请融资服务时填写的借款金额、借款用途、借款期限等借款需求，综合前述对用户资质评估的结果，最终为用户匹配推介合适的融资渠道服务，并根据用户自主选择协助用户完成借款申请。</p>

      <p><span class="n">第十五条</span>鸿特信息的服务专员将为用户提供详尽、专业、高效的借款咨询服务，并根据用户借款需求和预留的联系方式与用户在线下取得联系，为用户在线下提供进一步的业务信息咨询和跟踪服务。</p>

      <p><span class="n">第十六条</span>用户应知晓并理解，鸿特信息提供的服务在任何情况下均不构成对鸿特金服平台用户成功达成借款需求的承诺或向任何人士接受服务和产品的要约邀请。鸿特信息依用户需求为其提供借款信息咨询服务，鸿特金服平台用户据此与任何第三方进行交易的，产生的风险由其自行负担，用户无权据此向鸿特信息提出任何法律主张。用户在交易过程中与第三方之间发生纠纷，由纠纷各方自行解决，鸿特信息不承担责任。</p>

      <h1>第三章 账户安全和管理</h1>

      <p><span class="n">第十七条</span>您遵照鸿特金服平台注册提示，成功注册之后，即建立了自己的鸿特金服平台账户，该账户具有唯一性、专有性，您承诺妥善保管自己的账户。您可以通过用户名和密码登录账户，使用鸿特金服平台服务。</p>

      <p><span class="n">第十八条</span>鸿特金服平台用户应妥善保管自己的用户名和密码，了解并同意，确保账户及密码的机密安全是用户的责任。用户不对其他任何人泄露账户和密码，不将账户转让、赠与或授权给第三方使用。任何您的注册账户进行的操作均视为您本人操作，且具有不可逆转性。因操作所产生的电子信息记录和痕迹均为您行为的有效凭证，您不得以任何理由要求取消或变更，且应当承担由此产生的全部责任</p>

      <p><span class="n">第十九条</span>如发现有他人冒用或盗用您的账户及密码或任何其他未经合法授权之情形时，应立即以有效方式通知鸿特信息，要求鸿特信息暂停相关服务。同时，您理解鸿特信息对您的请求采取行动需要合理期限，在鸿特信息采取实际行动之前，鸿特信息台对第三方使用该服务所导致的损失不承担任何责任。</p>

      <p><span class="n">第二十条</span>冒用或者盗用他人账户及密码的，鸿特信息保留追究实际使用人连带责任的权利。</p>

      <p><span class="n">第二十一条</span>若发生以下情形之一的，鸿特金服平台有权先行暂停、中断或终止向用户提供本协议项下的全部或部分会员服务，并将注册资料移除或删除，且无需通知用户：
      1、鸿特金服平台认为用户提供的个人资料不具有真实性、有效性或完整性；
      2、用户使用任何第三方程序进行登录或使用服务或其他不正当的技术手段进行危害鸿特金服平台安全，包括但不限于篡改数据、窃取客户信息、通过鸿特金服平台攻击其他已注册账户等；
      3、鸿特金服平台认为用户账户涉嫌洗钱、套现、传销、被冒用或其他鸿特金服平台认为有风险之情形；
      4、鸿特金服平台认为用户已经违反本协议中规定的各类规则及精神；
      5、用户账户已连续一年内未登录；
      6、鸿特金服平台认为有可能影响鸿特金服平台和其他用户安全的其他情形。</p>

      <p><span class="n">第二十二条</span>用户同意，账户的暂停、中断或终止不代表用户责任的终止，用户仍应对使用鸿特金服平台服务期间的行为承担可能的违约或损害赔偿责任，同时鸿特金服平台仍可保有用户的相关信息。</p>

      <h1>第四章 服务中断和故障</h1>

      <p><span class="n">第二十三条</span>基于互联网的特殊性，鸿特信息不担保服务不会中断，也不担保服务的及时性和/或安全性。系统因相关状况无法正常运作，使鸿特金服平台用户无法使用任何鸿特金服平台服务或使用任何鸿特金服平台服务时受到任何影响，鸿特金服平台对用户或第三方不负任何责任，前述状况包括但不限于：
      1、鸿特金服平台系统停机维护期间。
      2、电信设备出现故障不能进行数据传输的。
      3、由于黑客攻击、网络供应商技术调整或故障、客户端升级等原因而造成的鸿特金服平台服务中断或延迟。
      4、因台风、地震、海啸、洪水、停电、战争、恐怖袭击等不可抗力之因素，造成鸿特金服平台系统障碍不能执行业务的。</p>

      <h1>第五章 责任范围及限制</h1>

      <p><span class="n">第二十四条</span>鸿特信息不对任何鸿特金服平台服务提供任何形式的保证，包括但不限于以下事项：
      1、鸿特金服平台服务将符合用户的需求。
      2、鸿特金服平台服务将不受干扰、及时提供或免于出错。
      3、用户经由鸿特金服平台服务取得之任何产品、服务、资讯或其他资料将符合用户的期望。</p>

      <p><span class="n">第二十五条</span> 鸿特金服平台服务的合作单位所提供的服务品质及内容由该合作单位自行负责。鸿特金服平台的内容可能涉及由第三方所有、控制或者运营的其他网站（以下简称“第三方网站”）。鸿不能保证也没有义务保证第三方网站上任何信息的真实性和有效性。用户确认按照第三方网站的服务协议使用第三方网站，而不是按照本协议。第三方网站不是鸿特信息推荐或者介绍的，第三方网站的内容、产品、广告和其他任何信息均由用户自行判断并承担风险，而与鸿特金服平台无关。用户经由鸿特金服平台服务的使用下载或取得任何资料，应由用户自行考量且自负风险，因资料的下载而导致的任何损坏由用户自行承担。</p>

      <p><span class="n">第二十六条</span>用户自鸿特信息及鸿特信息服务专员或经由鸿特信息服务取得的建议或资讯，无论其为书面或口头，均不构成鸿特信息对鸿特金服平台服务的任何保证。</p>

      <p><span class="n">第二十七条</span>鸿特信息不保证为向用户提供便利而设置的外部链接的准确性、有效性、安全性和完整性，同时，对于该等外部链接指向的不由鸿特信息实际控制的任何网页上的内容，鸿特信息不承担任何责任。</p>

      <p><span class="n">第二十八条</span> 在法律允许的情况下，鸿特信息对于与本协议有关或由本协议引起的，或者，由于使用鸿特信息、或由于其所包含的或以其它方式通过鸿特金服平台提供给用户的全部信息、内容、材料、产品（包括软件）和服务引起的任何间接的、惩罚性的、特殊的、派生的损失（包括但不限于业务损失、收益损失、利润损失、使用数据或其他经济利益的损失），不论是如何产生的，也不论是由对本协议的违约（包括违反保证）还是由侵权造成的，均不负有任何责任，即使其事先已被告知此等损失的可能性。另外即使本协议规定的排他性救济没有达到其基本目的，也应排除鸿特信息对上述损失的责任。</p>

      <h1>第六章 风险提示</h1>

      <p><span class="n">第二十九条</span>用户了解并认可，任何通过鸿特金服平台进行的交易并不能避免以下风险的产生，鸿特信息不能也没有义务为如下风险负责：
      1、宏观经济风险：因宏观经济形势变化，可能引起价格等方面的异常波动，用户有可能遭受损失；
      2、政策风险：有关法律、法规及相关政策、规则发生变化，可能引起价格等方面异常波动，用户有可能遭受损失；
      3、违约风险：因其他交易方无力或无意愿按时足额履约，用户有可能遭受损失；
      4、预期利率风险：市场预期利率变化可能对购买或持有产品的实际收益产生影响；
      5、不可抗力因素导致的风险；
      6、因用户的过错导致的任何损失 ，该过错包括但不限于：决策失误、操作不当、遗忘或泄露密码、密码被他人破解、用户使用的计算机系统被第三方侵入、用户委托他人代理交易时他人恶意或不当操作而造成的损失。</p>

      <p><span class="n">第三十条</span>鸿特金服平台不对任何用户及/或任何交易提供任何担保或条件，无论是明示、默示或法定的。鸿特金服平台不能也不试图对用户发布的信息进行控制，对该等信息，鸿特金服平台不承担任何形式的证明、鉴定服务。鸿特金服平台不能完全保证鸿特金服平台内容的真实性、充分性、可靠性、准确性、完整性和有效性，并且无需承担任何由此引起的法律责任。鸿特金服平台用户应依赖于用户自己的独立判断进行服务申请和交易，用户应对其作出的判断承担全部责任。</p>

      <p><span class="n">第三十一条</span>以上并不能揭示用户通过鸿特金服平台服务及交易的全部风险及市场的全部情形。用户在通过鸿特金服平台服务做出交易决策前，应全面了解相关交易，根据自身的交易目标、风险承受能力和资产状况等谨慎决策，并自行承担全部风险。</p>

      <h1>第七章 隐私权保护及授权条款</h1>

      <p class="bold"><span class="n">第三十二条</span>鸿特信息对于用户提供的、鸿特信息自行收集的、经认证的个人信息将按照本协议予以保护、使用或者披露。鸿特信息无需用户同意即可向鸿特信息关联实体转让与鸿特金服平台有关的全部或部分权利和义务。未经鸿特信息事先书面同意，用户不得转让其在本协议项下的任何权利和义务。</p>

      <p class="bold"><span class="n">第三十三条</span>用户同意授权鸿特信息，为用户提供资质认证等服务需要，可以自行或通过第三方获取、采集、留存用户包括但不限于手机设备信息、SIM卡识别和服务信息、通信通讯内容记录及网络相关信息等等移动终端设备和通讯服务相关信息。</p>

      <p class="bold"><span class="n">第三十四条</span>用户同意鸿特信息对用户提交或鸿特信息搜集的用户个人信息（包括但不限于您的姓名、身份证信息、银行卡信息、学历信息、通信通讯信息、联系方式、财产状况、行踪轨迹、个人信用、个人社会保险信息、黑名单等不良信用信息等）进行核实认证，并对获得的核实结果根据本协议进行查看、使用和留存等操作，并建立用户个人信用数据。但鸿特信息对用户身份的准确性和绝对真实性不做任何保证。</p>

      <p class="bold"><span class="n">第三十五条</span> 用户同意鸿特信息，除法律另有规定之外，基于为用户提供更优质服务和产品的目的，向鸿特信息因服务必要开展合作的第三方提供、查询、采集个人基本信息、财产信息、通讯信息、信用信息（含不良信用信息），鸿特信息提供、查询、采集的该等信息可能产生的不利后果由用户自行承担。</p>

      <p class="bold"><span class="n">第三十六条</span> 鸿特信息按照用户在鸿特金服平台上的行为自动追踪关于用户的某些资料。在不透露用户的隐私资料的前提下，鸿特信息有权对整个注册用户数据库进行分析并对数据库进行商业上的利用。</p>

      <p class="bold"><span class="n">第三十七条</span>在用户将资金汇入其账户但并未使用之前，用户同意鸿特信息及/或第三方机构为用户提供资金管理服务。</p>

      <p class="bold"><span class="n">第三十八条</span>用户通过鸿特信息平台进行各项交易或接受交易款项时，若用户未遵从本服务协议条款或鸿特信息平台公布的规则中的操作指示，鸿特信息不承担任何责任。若用户未按照规则进行操作导致款项错误汇入用户账户，该用户同意鸿特信息有权直接从该用户账户中扣回款项，同时鸿特信息有权禁止该用户要求支付此笔款项。此款项若已汇入该用户的银行账户，该用户同意鸿特信息有权向该用户事后索回，由此产生的追索费用由该用户承担。</p>

      <p class="bold"><span class="n">第三十九条</span>用户同意并确认，当用户未按约定偿还本息及其他相关费用时，鸿特信息有权将用户列入黑名单，并有权以各种通讯手段（包括但不限于：电话、短信、微信等各种通讯手段）告知用户的近亲属、朋友用户的欠款信息，并在“小派钱包”平台或其他报纸、网站上发布用户的欠款信息，信息内容包括但不限于用户的姓名、身份证号码、住址、工作单位、照片、欠款金额、逾期时间及违约责任等。鸿特信息有权根据自身的单独判断或者与该笔交易有关的平台其他用户的请求将用户的个人资料和信息、鸿特信息自行收集的用户的个人资料和信息对与该笔交易有关的平台其他用户或第三方披露，或与任何第三方（包括但不限于中国人民银行个人信用信息基础数据库及信贷征信主管部门批准建立的个人信用数据库）进行数据共享，而不受隐私保护的限制，由此可能给用户造成的任何损失，由用户自行承担。</p>

      <p class="bold"><span class="n">第四十条</span>用户同意鸿特信息可以使用用户的个人或企业资料通过分析鸿特信息的使用率以改善鸿特信息内容和产品推广，并使鸿特信息内容、设计和服务更能符合用户的要求，从而使用户在使用鸿特信息的服务时得到更为便利、高效、安全的交易体验。用户同意鸿特信息利用用户的资料与用户联络并向用户传递（在某些情况下）针对用户的兴趣而提供的信息，例如：有针对性的广告条、行政管理方面的通知、产品提供以及有关用户使用鸿特信息的通讯。</p>

      <p class="bold"><span class="n">第四十一条</span>经国家生效法律文书或行政处罚决定确认用户存在违法行为,或者鸿特信息有足够事实依据认定用户存在违法或违反本协议的行为，鸿特信息有权在互联网络上公布用户的违法、违约行为,并有权将该内容记入任何与用户相关的信用资料和档案。 </p>

      <p class="bold"><span class="n">第四十二条</span>除非鸿特信息或其合作方在特定借贷交易成立后的电子协议书中明示承担责任外，鸿特信息提供的服务中不带有对任何用户、任何交易的其他保证或条件,因此，鸿特信息及其股东、创建人、高级职员、董事、代理人、关联公司、母公司、子公司和雇员不保证鸿特信息内容的真实性、充分性、及时性、可靠性、完整性和有效性,并且免除任何由此引起的法律责任。 </p>

      <p class="bold"><span class="n">第四十三条</span>用户同意，鸿特金服平台可在鸿特金服平台的某些网页上使用诸如“Cookies”的资料收集装置。</p>

      <p class="bold"><span class="n">第四十四条</span>鸿特信息对于用户提供的、自行收集到的、经认证的个人信息或企业信息将尽最大的技术和管理可能按照隐私规则予以保护，鸿特信息不会恶意出售或免费共享给任何第三方，以下情况除外：
      1、提供独立服务且仅要求服务相关的必要信息的供应商，如印刷厂、邮递公司等；
      2、具有合法调阅信息权限并从合法渠道调阅信息的政府部门或其他机构，如公安机关、法院；
      3、鸿特信息的关联实体；
      4、经鸿特信息使用方或鸿特信息使用方授权代表同意的第三方。</p>

      <p class="bold"><span class="n">第四十五条</span> 用户授权鸿特信息，除法律另有规定之外，将用户提供给鸿特信息的信息、享受鸿特信息服务产生的信息以及鸿特信息根据本条约定查询、收集的信息，用于鸿特信息服务必要委托的鸿特信息关联实体或合作伙伴为用户提供服务、推荐产品、开展市场调查与信息数据分析。</p>

      <p class="bold"><span class="n">第四十六条</span>本条款自本协议签署时生效，具有独立法律效力，不受合同成立与否及效力状态变化的影响。</p>

      <p class="bold"><span class="n">第四十七条</span>如您不同意上述授权条款的部分或全部，可致电【客服热线（0769-22888877）】取消或变更授权。</p>

      <h1>第八章 知识产权的保护</h1>

      <p><span class="n">第四十八条</span>鸿特金服平台上所有内容，包括但不限于著作、图片、档案、资讯、资料、鸿特金服平台架构、鸿特金服平台画面的安排、网页设计，均由鸿特信息或其他权利人依法拥有其知识产权，包括但不限于商标权、专利权、著作权、商业秘密等。</p>

      <p><span class="n">第四十九条</span>非经鸿特信息或其他权利人书面同意，任何人不得擅自使用、修改、复制、公开传播、改变、散布、发行或公开发表鸿特金服平台程序或内容。</p>

      <p><span class="n">第五十条</span>非经鸿特信息明确书面同意，不得修改鸿特金服平台或其任何部分；不得对本鸿特金服平台或其内容进行复制、复印、仿造、出售、转售或以其他方式加以利用；不得收集和利用鸿特金服平台服务及产品目录、说明和价格（如有）；不得对鸿特金服平台或其内容进行任何衍生利用；不得为其他商业利益而下载、截取或拷贝账户信息或使用任何数据采集和摘录工具等。另外，严禁为任何未经本使用条件明确允许的目的而使用本鸿特金服平台上的内容和材料。</p>

      <p><span class="n">第五十一条</span>非经鸿特信息的书面许可，不得将鸿特金服平台或其关联公司的商标、标识或其他专有信息（包括图像、文字、网页设计或形式）据为己有，任何未经授权的使用都会终止鸿特金服平台所授予的允许或许可。</p>

      <p><span class="n">第五十二条</span>尊重知识产权是用户应尽的义务，如有违反，用户应对鸿特信息承担损害赔偿等法律责任。</p>

      <h1>第九章 条款的解释、法律适用及争端解决</h1>

      <p><span class="n">第五十三条</span>本协议是由用户与鸿特信息共同签订的，适用于用户在鸿特金服平台的全部活动。本协议内容包括但不限于协议正文条款及已经发布的或将来可能发布的各类规则，所有条款和规则为协议不可分割的一部分，与协议正文具有同等法律效力。</p>

      <p><span class="n">第五十四条</span>本协议不涉及用户与第三方之间交易而产生的法律关系及法律纠纷。但用户在此同意将全面接受并履行与第三方通过鸿特金服平台服务在鸿特金服平台签订的任何电子法律文本，并承诺按照该法律文本享有和（或）放弃相应的权利、承担和（或）豁免相应的义务。</p>

      <p><span class="n">第五十五条</span>如本协议中的任何条款无论因何种原因完全或部分无效或不具有执行力，则应认为该条款可与本协议相分割，并可被尽可能接近各方意图的、能够保留本协议要求的经济目的的、有效的新条款所取代，而且，在此情况下，本协议的其他条款仍然完全有效并具有约束力。</p>

      <p><span class="n">第五十六条</span>本协议及其修订的有效性、履行与本协议及其修订效力有关的所有事宜，将受中国法律管辖，任何争议仅适用中国法律。</p>

      <p><span class="n">第五十七条</span>本协议签订地为中国广东省东莞市。因本协议所引起的用户与鸿特信息的任何纠纷或争议，首先应友好协商解决，协商不成的，用户在此完全同意将纠纷或争议提交湛江仲裁委员会在东莞仲裁，并适用简易程序进行书面审理。仲裁裁决为终局裁决，对双方均具有约束力。</p>

      <p><span class="n">第五十八条</span>鸿特信息对本协议拥有最终解释权，鸿特信息保留单方面制定及调整鸿特金服平台服务费用收费标准的权利。</p>
  </div>
</template>

<script>
export default {
  name: 'RegProtocol',
  data () {
    return {

    }
  }
}
</script>

<style scoped lang="scss">
@import "~@sass/_variables";
@import "~@sass/_func";
  .RegProtocol {
    padding:0 pxToRem(30px);

    p {
      font-size:pxToRem($font-size-small);
      color:$font-gray-color;
      text-indent: pxToRem($font-size-small * 2);
      letter-spacing: pxToRem(2px);
      line-height: pxToRem(55px);
    }

    .bold {
      color: $font-black-color;
      font-weight: bold;
    }

    .n {
      padding-right:pxToRem(15px);
    }

    h1 {
      font-size: pxToRem($font-size-middle);
      color:$font-black-color;
      text-align: center;
      margin-top: pxToRem(60px);

      &.left {
        text-align: left
      }
    }
  }
</style>
