<template>
  <div id="InforeferProtocol">
      <h1 class="center">信息咨询服务协议</h1>

      <p>合同编号：<span class="bottom_line" v-html="poll(d.contractCode)"></span></p>
      <p>委托方（甲方）：<span class="bottom_line" v-html="poll(d.entrustName)"></span></p>
      <p>服务方（乙方）：<span class="bottom_line" v-html="poll(d.serviceName)"></span></p>
      <p>地址：<span class="bottom_line" v-html="poll(d.address)"></span></p>

      <p class="bold">鉴于：</p>
      <ul>
        <li>1.甲方为具有借款需求，且具有完全民事权利/行为能力的适格主体。</li>
        <li>2.乙方为从事借款咨询服务的专业公司，拥有专业的调查团队及卓越的行业信誉，有能力为甲方提供专业及高效的借款咨询服务。</li>
        <li>3.甲方愿意接受乙方提供的借款咨询服务，即由乙方协助甲方在团贷网平台金融服务平台（域名“www.tuandai.com”，以下简称“团贷网平台”）发标融资以及与合法的出借人或其他相关方达成协议并完成借贷交易，并由乙方提供与团贷网平台签署的电子《借款合同》履行有关的其他服务，乙方愿意向甲方提供该等服务。
              <p>为明确双方权利、义务，根据《中华人民共和国合同法》和有关法律法规规定，甲、乙双方经平等协商，签订本协议，以兹共同遵守。</p>
        </li>
      </ul>

      <h1>第一条.服务事项</h1>
      <p>
          乙方向甲方提供的服务主要包括以下内容：
          <ul>
            <li>1.甲方拟借款人民币（大写）<span class="bottom_line" v-html="poll(d.capitalMoney)"></span>（下称“借款本金”），期限为<span class="bottom_line" v-html="poll(d.dueTime)"></span>个月，借款起始日为出借人将借款金额划离出借人账户之日。甲方的借款用途为<span class="bottom_line" v-html="poll(d.borrowerUse)"></span>，甲方保证借款用途符合国家有关法律法规的要求。乙方同意为甲方达成前述借款需求提供协助。</li>
            <li>2.甲方知晓并理解，乙方提供的协助在任何情况下均不得理解为一定能协助甲方成功达成前述借款需求。若甲方无法从出借人取得前述借款款项，乙方仅需及时通知甲方，甲方不得以已签订本合同为由要求乙方出借资金或承担法律责任。</li>
            <li>3.基于甲方的借款需求，为甲方提供借款前咨询，包括解答借款相关问题、对甲方是否满足借款条件进行初步审查，指导及协助甲方填写申请材料、完成借款申请等。</li>
            <li>4.协助甲方完成借款申请资料的收集和准备，向甲方收集包括但不限于身份证明文件、银行账目往来流水、动产或不动产证明等贷款申请资料及信息，并对甲方资质及身份进行审查核实，为甲方现场解答借款相关问题。</li>
            <li>5.根据甲方申请资料的准备情况，对甲方借款资质、资信状况及偿债能力进行综合评估，对甲方是否能满足出借人出借资金      的条件进行审查，根据审查结果将甲方的借款需求向团贷网平台上的出借人进行推荐并递交申请资料，帮助甲方在团贷网平台建立有效账户，并将出借人放款与否的审查结果及时向甲方进行反馈，根据甲方授权协助或代表甲方签署包括但不限于团贷网平台电子《借款协议》等法律文件。</li>
          </ul>
      </p>

      <h1>第二条.支付方式</h1>
      <p>
        <ul>
          <li>1.甲方知晓并同意，为达成甲方的借款需求甲方需向出借人和乙方支付借款费用如下：
              <ul class="smalllP">
                <li>（1）基于出借人为甲方提供借款，甲方同意按年化利率<span class="bottom_line" v-html="poll(d.yearRate)"></span>%向出借人支付利息，自借款起始日起算，至借款全部结清日止，不足一个月的按一个月计算。利息由甲方授权委托第三方，在指定的还款日期将款项从甲方指定账户自动划扣至出借人在团贷网平台开设的账户（以下简称“平台账户”）。</li>
                <li>（2）基于乙方为甲方提供本协议项下约定服务，甲方同意向乙方支付人民币<span class="bottom_line" v-html="poll(d.serviceMoney)"></span>元的信息咨询服务费（以下简称“服务费”），支付时间：于本协议签订当日支付人民币<span class="bottom_line" v-html="poll(d.firstServiceMoney)"></span>元，剩余服务费甲方按以下第<span class="bottom_line" v-html="poll(d.payWay)"></span>种方式于每月<span class="bottom_line" v-html="poll(today)"></span>日前向乙方支付。
                      <ul class="smalllP">
                        <li>A、每月支付人民币<span class="bottom_line" v-html="poll(d.perServiceMoney)"></span>元，直到支付完全部服务费。</li>
                        <li>B、第一年每月支付人民币<span class="bottom_line" v-html="poll(d.firstYearMoney)"></span>元，第二年每月支付人民币<span class="bottom_line" v-html="poll(d.secondYearMoney)"></span>元，第三年每月支付人民币<span class="bottom_line" v-html="poll(d.thirdYearMoney)"></span>元，第四年每月支付人民币<span class="bottom_line" v-html="poll(d.fourthYearMoney)"></span>元，直至支付完全部服务费。    </li> 
                      </ul>
                </li>
                <li>（3）若甲方申请提前结清全部借款本金的，在结清借款前，甲方需一次性向乙方支付结清时当月服务费的二倍作为违约金。</li>
              </ul>
          </li>
          <li>2.在甲方委托的第三方划扣不成功时，甲方授权委托由乙方代收其还款款项（本金、利息、违约金（如有）等）并代为向出借人还款。</li>
        </ul>
      </p>

      <h1>第三条.借款人还款</h1>
      <p>
        <ul>
          <li>1.还款日及截止时间：
              <ul class="smalllP">
                <li>（1）甲方应根据《借款协议》的约定在借款起始日的次月起开始按月偿还本金、利息及相关费用，每一个月为一个还款期。还款日为：借款起始日相对应日的前一日，若还款当月无借款相对应之日的，则以该月最后一个公历日作为该月之还款日；若还款日为法定节假日或公休日，还款日不随之顺延，甲方应配合在法定节假日或公休日的前一日进行还款。</li>
                <li>（2）乙方可于出借人发放借款后通知甲方借款起始日及还款日。</li>
                <li>（3）甲方应在每期还款日的18点前足额偿还当期应还金额。</li>
                <li>（4）甲方实际的还款日期按甲方资金到达出借人账户或乙方指定账户的日期计算。</li>
              </ul>
          </li>
          <li>2.还款金额
              <p>甲方每期应还金额 = 当期本息（依借款合同约定） + 当期服务费（依本协议约定） + 代扣手续费（如有）+违约金（如有），甲方应按时、足额向乙方支付每期应还款金额。</p>
             
          </li>
          <li>3.还款方式
              <ul class="smalllP">
                <li>（1）甲方已授权第三方（详见甲方与第三方签署的《还款服务委托书》）从甲方银行账户（以下简称“扣款账户”）中划扣各期应还款总额至出借人。甲方应保证还款日约定扣款账户内资金充足直至第三方扣款成功，如因甲方原因导致第三方未能在还款日足额扣款，包括但不限于甲方扣款账户余额不足、甲方办理该账户挂失、销户、银行止付等情况且未通知乙方并因此造成逾期的，甲方应按《借款协议》向出借人承担逾期支付的违约责任；</li>
                <li>（2）甲方若无法通过委托划扣方式支付每期应还款额，应第一时间通知乙方，经乙方同意，甲方可以通过转账方式将应还款项转至乙方指定银行账户。</li>
              </ul>
          </li>
          <li>4.还款分配顺序
              <p>甲方同意其实际还款金额按以下顺序分配：先分配时间在前的应还款项，再分配时间在后的应还款项；分配顺序依次为：违约金（如有）、利息、代扣手续费（如有）、本金。</p>
          </li>
          <li>5.提前结清
              <ul class="smalllP">
                <li>（1）甲方如需提前结清借款应在还款日前七个工作日向乙方提出申请，乙方与出借人沟通并得到出借人同意后进行操作。</li>
                <li>（2）出借人不接受甲方提前部分结清的，若甲方提前还款的金额小于提前结清时甲方应还总额的，提前还款的金额将作为提存的还款保证金，到还款日时按还款分配的顺序转化为应还金额。</li>
                <li>（3）任何情况下，甲方提前结清的，乙方一概不返还甲方已支付的服务费。</li>
              </ul>
          </li>
          <li>6.借款逾期
               <ul class="smalllP">
                 <li>（1）甲方发生下列情形之一时，视为甲方借款逾期：
                      <ul class="smalllP">
                        <li>A.于还款日当日18点时，未支付或未足额支付当期应还金额。</li>
                        <li>B.于本合同或借款到期日，或甲方依本合同之规定视为全部借款提前到期时，未支付或未足额支付当期应还金额。</li>
                      </ul>
                 </li>
                 <li>（2）甲方发生借款逾期时，应优先通过委托第三方从甲方银行账户划扣应还款总额的方式还款。</li>
                 <li>（3）借款逾期期间为：逾期发生日起至清偿全部应还款项日止。</li>
               </ul>
          </li>
        </ul>
      </p>

      <h1>第四条.双方的权利与义务</h1>
      <p>
        <ul>
          <li><span class="bold">1.乙方的权利与义务</span>
              <ul class="smalllP">
                <li>（1）乙方应尽力协助甲方与合法的出借人及其他相关方达成协议并完成借款交易。</li>
                <li>（2）经乙方协助，甲方成功从合法的出借人处取得借款的，甲、乙双方、出借人及相关合作方平台签订电子《借款协议》。</li>
                <li>（3）无需征求甲方的同意，乙方有权使用、核实、处理、保留甲方基于本合同所提供的相关资料。</li>
                <li>（4）乙方有权按照本合同及甲方在团贷网平台签署的电子《借款协议》的约定向甲方收取甲方全部应还款项。</li>
                <li>（5）甲方借款成功后，如再发生向第三方借款或为第三方提供担保的情形，应在3个工作日内书面告知乙方，乙方有权终止本合同并要求甲方向出借人提前结清应还款项。本条款不受第三条第6款第（1）点的限制。</li>
                <li>（6）若甲方未按时足额支付每期应还款额，乙方有权自行催收或委托第三方进行催收，催收方式为采取法律所允许的所有措施（包括但不仅限于信件、短信、电话、上门、诉讼等方式）向甲方进行催收。因催收甲方逾期借款所产生的费用（包括但不限于人工费、交通费、通讯费等）由甲方承担。</li>
                <li>（7）本合同生效后，甲方不得单方撤销委托，若甲方撤销，甲方仍应向乙方履行本协议第二条第2款规定的付款义务。</li>
              </ul>
          </li>
          <li><span class="bold">2.甲方的权利与义务</span>
              <ul class="smalllP">
                <li>（1）甲方保证按照借款申请时的用途使用资金，未经乙方书面同意，不得擅自改变借款用途。</li>
                <li>（2）甲方应按照乙方的要求提供包括但不仅限于个人信息、工作情况、企业信息及经营情况、资产证明、收入情况、家庭情况、信用报告、负债情况、历史偿债情况等相关资料，并保证这些资料的真实、完整和有效。否则，甲方应当向乙方承担本合同约定的违约责任，并赔偿因此对乙方及出借人造成的损失。</li>
                <li>（3）甲方承诺在本合同终止前，如甲方发生基于本合同所提供的相关资料和信息的变更，甲方应在资料或信息发生变更之日起三日内书面通知乙方，在甲方通知乙方及办理完成变更手续前，因此产生的一切后果由甲方承担，造成乙方损失的，甲方应承担赔偿责任。</li>
                <li>（4）就本合同中的相关各方为甲方提供本合同项下的约定服务及借款本金，甲方同意向乙方及相关各方支付借款费用及按期归还本金。</li>
                <li>（5）甲方应对乙方提供的有关商业信息、资料保密。</li>
              </ul>
          </li>
        </ul>
      </p>

      <h1>第五条.  委托授权</h1>
      <p>
        <ul>
          <li>1.甲方授权乙方以甲方名义在团贷网平台注册账户及进行管理。甲方承诺，在委托期限内不得自行在团贷网平台以出借人的身份另行注册。</li>
          <li>2.甲方授权乙方以甲方的名义在团贷网及\或团贷网合作机构发布借款需求信息，包括但不限于发布甲方个人信息（包括但不限于姓名、性别、年龄、学历、家庭情况、户籍、资产情况、身份证件以及个人相关征信信息等）、借款需求信息（如借款金额、期限、利率、用途、担保措施等）等与借款相关的及团贷网合作机构要求发布的其他信息。如在前述借款信息发布之日起2个工作日后仍未能实现匹配借款，乙方可取消已经发布的借款需求，甲方予以接受。</li>
          <li>3.甲方授权乙方在相关机构（包括但不限于金融机构、税务、工商、征信机构、人民法院等）查询、确认甲方的相关征信信息，并授权团贷网将甲方在团贷网的借款信息向团贷网合作机构进行披露，但合作机构应承担同等保密义务。</li>
          <li>4.乙方已向甲方提供团贷网平台的线上服务协议及《借款协议》的合同版本并已解释协议内容、签署方式及效力，甲方已全部理解并能接受前述两项协议中的全部内容，甲方同意采用电子文本形式制作的前述协议，由乙方以甲方名义注册甲方团贷网账户，并通过操作甲方团贷网账户，以甲方名义代为签署的《借款协议》电子文本，一经乙方点击确认，相关协议即对甲方发生效力，甲方同意受前述两项协议的约束。</li>
          <li>5.委托期限：自本协议生效之日起至甲方在团贷网平台签署的《借款协议》、以及与团贷网签署的《团贷网服务协议》、与担保公司签署的《提供担保协议书》项下甲方的义务全部履行完毕之日止。</li>
          <li>6.甲方授权乙方在甲方绑定个人信息（包括但不限于个人身份证明、手机号码及通讯录等）时，可一键获取甲方的手机通讯录信息数据。若甲方发生逾期或者违约，乙方可向借款人及相关通讯录联系人履行催收等权利。</li>
          <li>7.特别约定：甲方在此做出不可撤销的承诺：甲方在上述《借款协议》及与团贷网签署的《团贷网|网贷投资服务协议》、与担保公司签署的《提供担保协议书》以及本协议项下约定的义务未全部履行完毕之前，不得单方撤销本协议中对乙方的任何授权委托。</li>
        </ul>
      </p>

      <h1>第六条.违约责任</h1>
      <p>
          <ul class="bold">
            <li>1.甲方未履行或未充分履行本协议及甲方在团贷网平台签署的电子《借款合同》项下的各项义务时构成违约。</li>
            <li>2.甲方违约时，乙方有权将甲方的信息进行公开披露，披露途径包括但不限于媒体、公安机关、法院、其他司法机关和征信系统，且乙方无需对此承担任何责任。</li>
          </ul>        
      </p>

      <h1>第七条.甲方个人信用信息</h1>
      <p> 甲方同意乙方向征信机构提供甲方本次借款申请所登记的个人信息、借款信息、后续还款记录及本人还款的不良记录等信息，甲方确认已被明确告知提供上述信息可能会给本人的信用带来的影响及不确定的后果，甲方仍然同意乙方向征信机构提供前述信息。 </p>
     
      <h1>第八条.其他约定</h1>
      <p>
        <ul>
            <li>1.甲方确认，在保证对甲方的服务不变的前提下，如出借人将《借款协议》下的债权转让给第三方，无须征得甲方同意。甲方仍按借款协议约定对债权受让方承担还款等责任。</li>
            <li>2.关于乙方、甲方、出借人及其他相关方所签订的《借款协议》电子合同，《借款协议》作为本合同附件，是本合同不可缺少的组成部分，甲、乙双方已阅读并明确《借款协议》的全部内容。甲、乙双方委托乙方的合作平台代为保管签订的《借款协议》电子合同，如果甲方需查阅或使用该《借款协议》，可联系乙方协助处理。</li>
        </ul>        
      </p>

      <h1>第九条.通知与送达</h1>
      <p>
        甲方向乙方发出的本合同项下的任何通知在下列时间视为送达：
        <ul>
          <li>（1）以信件方式发出的，以信件送达日期视为送达日；</li>
          <li>（2）以传真方式发出的，以发送成功之时视为送达；</li>
          <li>（3）以手机信息（包括但不限于短信、微信）方式发出的，以信息发送成功之时视为送达。</li>
        </ul>
      </p>

      <h1>第十条.    争议解决</h1>
      <p>因本协议发生的任何争议，由双方协商解决，协商不成的，任何一方提交<span class="bottom_line" v-html="poll(d.disputeSolve)"></span>。</p>

      <h1>第十一条.合同生效及终止</h1>
      <p>本协议一式贰份，甲乙双方各执壹份，自甲、乙双方签字或盖章后生效，至本协议项下权利义务履行完毕之日或本协议约定的导致合同终止的条件满足时终止。如果甲方的借款或借贷交易最终未达成的，自甲方向乙方支付服务费后，本协议终止。</p>

     <p>甲方（签字及手印）：</p>
     <p>乙方（盖章）：</p>
     <div class="right">
      <p>签约日期：<span class="bottom_line">{{ new Date().getFullYear() }}</span> 年 <span class="bottom_line">{{ pad(new Date().getMonth() + 1, 2) }}</span> 月 <span class="bottom_line">{{ pad(new Date().getDate(), 2) }}</span> 日 </p>
     </div>
  </div>
</template>

<script>
import Toast    from '@components/toast/index.js'

export default {
  name: 'InforeferProtocol',
  data () {
    return {
       d: this.$store.state.InforeferProtocol || {}
    }
  },
   methods: {
     poll (data, n = 10) {
       data = data.toString();
       if (!data || !data.trim()) {
           return (new Array(n + 1)).join('&nbsp');
       }
       return data
     }
   },
  computed: {
    today () {
      // 取当天 - 1，如果是1号的话，那就变成30号
      return (new Date().getDate()) === 1 ? 30 : (new Date().getDate()) - 1;
    }
  },
  beforeMount () {
       if (!this.$store.state.InforeferProtocol) {
         this.$router.push('/sign')
         Toast('协议内容未找到，请重试');
       }
   }
}
</script>

<style scoped lang="scss">
@import "../../sass/variables";
@import "../../sass/func";
  #InforeferProtocol {
    padding:0 pxToRem(30px);
    font-size:pxToRem($font-size-small);
    color:$font-gray-color;
    text-indent: pxToRem(30px);
    letter-spacing: pxToRem(2px);
    line-height: pxToRem(55px);
    word-break: break-all;


    .bottom_line {
        border-bottom: 1px solid #000;
        padding-bottom: pxToRem(5px);
        min-width: pxToRem(100px);
    }

    .smalllP {
      font-size:pxToRem(20px);
    }

    .right {
      text-align: right;
    }

    .bold {
      color: $font-black-color;
      font-weight: bold;

    }

    .b {
      text-decoration: underline;
    }

    .n {
      padding-right:pxToRem(15px);
    }

    li {
      list-style: none;
    }

    h1 {
      font-size: pxToRem($font-size-middle);
      color:$font-black-color;
      text-align: center;
      margin-top: pxToRem(60px);
      text-indent: pxToRem(0px);


      &.center {
        text-align: center;
      }
    }
  }
</style>
